app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."slug" = $1 LIMIT 1  [["slug", "companies"]]
---
  def show
    binding.pry
    @category = Category.find_by(slug: params[:slug])