app/controllers/projects_controller.rb

  def index
    if params.include?("category_id")
      @category = Category.find(params[:category_id])
      @projects = @category.projects.all
---
SELECT "projects".* FROM "projects"

  def show
    @projects = Project.find(params[:id].to_i)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 3]]