app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user = add_role(@user, params[:user][:role])
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = current_user

    if !@user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "username" = $3, "password_digest" = $4, "updated_at" = $5 WHERE "users"."id" = $6