app/controllers/users/cart_projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 62]]
---
  def new
    @project = Project.find(params[:project])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 78]]
---
  def create
    project = Project.find(params[:cart_project][:project_id])