app/controllers/users/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."slug" = $1 LIMIT 1  [["slug", "buy-me-a-goat"]]
---
  def show
    @project = Project.find_by_slug(params[:id])